Revit 2024 API
BuiltInFailures.StairRampFailures.NotEnoughRisers Property
 Actual Number of Risers is different from Desired Number of Risers. Add/remove Risers or change Desired Number of Risers in Stairs Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotEnoughRisers { get; }
Visual Basic
Public Shared ReadOnly Property NotEnoughRisers As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotEnoughRisers {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace